Public Attributes | List of all members
API_IFCPropertySingleValue Struct Reference
Element Manager
IFC property with a single value. More...
#include <APIdefs_Properties.h>
 Public Attributes
 API_IFCPropertyValue  | nominalValue
Value of the property.
Detailed Description
IFC property with a single value.
Remarks
This structure contains the value of an IfcPropertySingleValue